In [106]:
import pandas as pd

In [107]:
import numpy as np

In [108]:
df = pd.DataFrame(np.random.randint(0,10,12).reshape(3,4), 
                 columns = ['a','b','c','d'],
                 index = ['one', 'two', 'three'])

In [109]:
print(df)

       a  b  c  d
one    6  1  4  8
two    2  5  4  1
three  0  9  1  6

In [110]:
f = lambda x : x.max() - x.min()

In [111]:
df.apply(f) # by columns

a    6
b    8
c    3
d    7
dtype: int64

In [112]:
df.apply(f, axis=1) # apply by row

one      7
two      4
three    9
dtype: int64

In [113]:
s = pd.Series([2,3,5,7,11], index = ['a','b','c','d','e'])

In [114]:
print(s)

a     2
b     3
c     5
d     7
e    11
dtype: int64

In [115]:
g = lambda x : x**x

In [116]:
s.map(g)

a               4
b              27
c            3125
d          823543
e    285311670611
dtype: int64

In [117]:
df.map(g)

AttributeError: 'DataFrame' object has no attribute 'map'

In [118]:
df.map(g, axis=1) # why ?

AttributeError: 'DataFrame' object has no attribute 'map'

In [119]:
df.applymap(g)

           a          b    c         d
one    46656          1  256  16777216
two        4       3125  256         1
three      1  387420489    1     46656

In [120]:
df

       a  b  c  d
one    6  1  4  8
two    2  5  4  1
three  0  9  1  6

In [121]:
df.applymap(np.sqrt)

              a         b    c         d
one    2.449490  1.000000  2.0  2.828427
two    1.414214  2.236068  2.0  1.000000
three  0.000000  3.000000  1.0  2.449490

In [122]:
def h(x):
    return 3*x -1

In [123]:
df.applymap(h)

        a   b   c   d
one    17   2  11  23
two     5  14  11   2
three  -1  26   2  17

In [157]:
df1 = pd.DataFrame(np.random.randint(0,10,12).reshape(3,4),
                    index = ['three', 'one', 'two'],
                    columns = ['c','b','a','d'])

df1

       c  b  a  d
three  8  2  5  9
one    2  2  4  7
two    6  1  0  6

In [154]:
df1.sort_index()

       a  b  c  d
one    3  8  2  6
three  6  9  7  2
two    3  9  7  1

In [155]:
df1.sort_index(axis=1)

       a  b  c  d
three  6  9  7  2
two    3  9  7  1
one    3  8  2  6

In [156]:
df1.sort_index(axis = 'columns')

       a  b  c  d
three  6  9  7  2
two    3  9  7  1
one    3  8  2  6

In [128]:
print(df1)
df1.sort_index(inplace = True, axis = 'index')
print(df1)
# print(df2)
print(df1)

       c  a  b  d
three  2  9  6  2
two    1  9  8  9
one    3  9  4  9
       c  a  b  d
one    3  9  4  9
three  2  9  6  2
two    1  9  8  9
       c  a  b  d
one    3  9  4  9
three  2  9  6  2
two    1  9  8  9

In [129]:
df1

       c  a  b  d
one    3  9  4  9
three  2  9  6  2
two    1  9  8  9

In [130]:
df1.sort_index() # 정렬 기준 ?

       c  a  b  d
one    3  9  4  9
three  2  9  6  2
two    1  9  8  9

In [131]:
df3 = pd.DataFrame(np.array([i%11 for i in range(12,0,-1)]).reshape(3,4),
                   index = ['1','2','3'],
                    columns = ['a','b','c','d'])

In [132]:
df3

   a  b   c  d
1  1  0  10  9
2  8  7   6  5
3  4  3   2  1

In [133]:
df4 = df3.sort_index(axis = 1 )

In [134]:
df4

   a  b   c  d
1  1  0  10  9
2  8  7   6  5
3  4  3   2  1

In [158]:
df1.sort_index(axis = 1).sort_index(axis = 0)

       a  b  c  d
one    4  2  2  7
three  5  2  8  9
two    0  1  6  6

In [159]:
df1

       c  b  a  d
three  8  2  5  9
one    2  2  4  7
two    6  1  0  6

In [160]:
df1.sort_index(axis = 1, ascending = False)

       d  c  b  a
three  9  8  2  5
one    7  2  2  4
two    6  6  1  0

In [161]:
df1.sort_index(axis = 1)

       a  b  c  d
three  5  2  8  9
one    4  2  2  7
two    0  1  6  6

In [162]:
print(s)

a     2
b     3
c     5
d     7
e    11
dtype: int64

In [163]:
s['i'] = np.nan

In [164]:
s

a     2.0
b     3.0
c     5.0
d     7.0
e    11.0
i     NaN
dtype: float64

In [165]:
s['A'] = np.nan

In [166]:
s

a     2.0
b     3.0
c     5.0
d     7.0
e    11.0
i     NaN
A     NaN
dtype: float64

In [167]:
s.sort_index()

A     NaN
a     2.0
b     3.0
c     5.0
d     7.0
e    11.0
i     NaN
dtype: float64

In [168]:
s.sort_index(ascending = False)

i     NaN
e    11.0
d     7.0
c     5.0
b     3.0
a     2.0
A     NaN
dtype: float64

In [169]:
s.sort_values()

a     2.0
b     3.0
c     5.0
d     7.0
e    11.0
i     NaN
A     NaN
dtype: float64

In [170]:
s.sort_values(ascending = False)

e    11.0
d     7.0
c     5.0
b     3.0
a     2.0
i     NaN
A     NaN
dtype: float64

In [171]:
print(df)

       a  b  c  d
one    6  1  4  8
two    2  5  4  1
three  0  9  1  6

In [173]:
df.sort_values(by = ['a','b','c','d'])

       a  b  c  d
three  0  9  1  6
two    2  5  4  1
one    6  1  4  8

In [176]:
df.sort_values(by = ['c'])

       a  b  c  d
three  0  9  1  6
one    6  1  4  8
two    2  5  4  1

In [177]:
df.sort_values(by = ['c'], ascending = False)

       a  b  c  d
one    6  1  4  8
two    2  5  4  1
three  0  9  1  6

In [179]:
df.sort_values(axis = 1, by = 'one')

       b  c  a  d
one    1  4  6  8
two    5  4  2  1
three  9  1  0  6

In [187]:
df.sort_values(by=['d','b'])

       a  b  c  d
two    2  5  4  1
three  0  9  1  6
one    6  1  4  8

In [186]:
df.sort_values(by=['d','b','c','a'])

       a  b  c  d
two    2  5  4  1
three  0  9  1  6
one    6  1  4  8

In [188]:
s2 = pd.Series([6,8,8,4,8], 
               index = ['a','b','c','d','e'])

In [189]:
print(s2)

a    6
b    8
c    8
d    4
e    8
dtype: int64

In [190]:
s2.rank()

a    2.0
b    4.0
c    4.0
d    1.0
e    4.0
dtype: float64

In [192]:
s2.rank(method='min')

a    2.0
b    3.0
c    3.0
d    1.0
e    3.0
dtype: float64

In [194]:
s2.rank(method='first')

a    2.0
b    3.0
c    4.0
d    1.0
e    5.0
dtype: float64

In [197]:
s2.rank(method='max')

a    2.0
b    5.0
c    5.0
d    1.0
e    5.0
dtype: float64

In [200]:
s3 = pd.Series(np.random.randint(0,10,12),
               index = ['a','c','e','r','y','i','o','p','q','z','b','c']
              )

In [201]:
s3

a    5
c    3
e    8
r    1
y    8
i    6
o    8
p    1
q    3
z    2
b    7
c    1
dtype: int64

In [202]:
s3['a']

5

In [203]:
s3['c']

c    3
c    1
dtype: int64

In [204]:
s3['b']

7

In [205]:
s3.index.is_unique

False

In [206]:
dir(s3)

['T',
 '_AXIS_LEN',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__float__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__int__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__long__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_accum_func',
 '_add_numeric_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_align_frame',
 '_align_series',
 '_arith_method',
 '_as_manager',
 '_attrs',
 '_binop',
 '_can_hold_na',
 '_check_inplace_and_allows_duplicate_labels',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_cmp_method',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_from_arguments',
 '_construct_result',
 '_constructor',
 '_constructor_expanddim',
 '_convert',
 '_convert_dtypes',
 '_data',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_duplicated',
 '_find_valid_index',
 '_flags',
 '_from_mgr',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_index_resolvers',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values',
 '_get_values_tuple',
 '_get_with',
 '_gotitem',
 '_hidden_attrs',
 '_index',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_init_dict',
 '_init_mgr',
 '_inplace_method',
 '_internal_names',
 '_internal_names_set',
 '_is_cached',
 '_is_copy',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_item_cache',
 '_ixs',
 '_logical_func',
 '_logical_method',
 '_map_values',
 '_maybe_update_cacher',
 '_memory_usage',
 '_metadata',
 '_mgr',
 '_min_count_stat_function',
 '_name',
 '_needs_reindex_multi',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_indexer',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_replace_single',
 '_repr_data_resource_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_axis_nocheck',
 '_set_is_copy',
 '_set_labels',
 '_set_name',
 '_set_value',
 '_set_values',
 '_set_with',
 '_set_with_engine',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_stat_function',
 '_stat_function_ddof',
 '_take_with_is_copy',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'a',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'attrs',
 'autocorr',
 'axes',
 'b',
 'backfill',
 'between',
 'between_time',
 'bfill',
 'bool',
 'c',
 'clip',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtype',
 'dtypes',
 'duplicated',
 'e',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'explode',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'ge',
 'get',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'i',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'interpolate',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'iteritems',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'o',
 'p',
 'pad',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'q',
 'quantile',
 'r',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'rdivmod',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'sem',
 'set_axis',
 'set_flags',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'std',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_list',
 'to_markdown',
 'to_numpy',
 'to_period',
 'to_pickle',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs',
 'y',
 'z']

In [209]:
s4 = pd.Series(np.random.randint(0,3,10))

In [210]:
print(s4)

0    2
1    2
2    0
3    0
4    2
5    0
6    0
7    0
8    2
9    2
dtype: int64

In [211]:
s4.is_unique

False

In [213]:
s4.unique()

array([2, 0])

In [214]:
s4[2]

0

In [219]:
s4[0]

2

In [227]:
print(df3)

   a  b   c  d
1  1  0  10  9
2  8  7   6  5
3  4  3   2  1

In [230]:
df3.loc[:,'a']

1    1
2    8
3    4
Name: a, dtype: int64

In [231]:
df3.loc[:, 'b']

1    0
2    7
3    3
Name: b, dtype: int64

In [232]:
type(df3.loc[:, 'a'])

pandas.core.series.Series

In [233]:
df4

   a  b   c  d
1  1  0  10  9
2  8  7   6  5
3  4  3   2  1

In [234]:
df4.duplicated()

1    False
2    False
3    False
dtype: bool

In [237]:
df4.drop_duplicates()

   a  b   c  d
1  1  0  10  9
2  8  7   6  5
3  4  3   2  1

In [239]:
s3

a    5
c    3
e    8
r    1
y    8
i    6
o    8
p    1
q    3
z    2
b    7
c    1
dtype: int64

In [247]:
s3.drop_duplicates()

a    5
c    3
e    8
r    1
i    6
z    2
b    7
dtype: int64

In [258]:
# s3.duplicated(subset = ['c'])
print(type(s3))
s3 = pd.DataFrame(s3)
print(type(s3))
s3.drop_duplicates()

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

   0
a  5
c  3
e  8
r  1
i  6
z  2
b  7

In [260]:
s3.duplicated()

a    False
c    False
e    False
r    False
y     True
i    False
o     True
p     True
q     True
z    False
b    False
c     True
dtype: bool

In [265]:
s3.duplicated([0])

a    False
c    False
e    False
r    False
y     True
i    False
o     True
p     True
q     True
z    False
b    False
c     True
dtype: bool

In [266]:
df4

   a  b   c  d
1  1  0  10  9
2  8  7   6  5
3  4  3   2  1

In [267]:
df4.duplicated()

1    False
2    False
3    False
dtype: bool

In [291]:
df4['c'][1]=2
print(df4)
print(df4.duplicated(['c']))
print(type(df4))

   a  b   c  d  (1, c)
1  1  0  10  9       2
2  8  7   2  5       2
3  4  3   2  1       2
1    False
2    False
3     True
dtype: bool
<class 'pandas.core.frame.DataFrame'>

In [276]:
df4

   a  b   c  d
1  1  0  10  9
2  8  7   6  5
3  4  3   2  1

In [292]:
df4.drop_duplicates([(1,'c')])

   a  b   c  d  (1, c)
1  1  0  10  9       2

In [296]:
df4.drop_duplicates(['c'], keep='last')

   a  b   c  d  (1, c)
1  1  0  10  9       2
3  4  3   2  1       2

In [301]:
df5 = pd.DataFrame(np.random.randn(12).reshape(3,4),
                    columns = ['a','b','c','d'])

In [302]:
df5

          a         b         c         d
0  0.515993  0.203251 -1.398453  1.023572
1  0.107543 -0.833964 -0.816209  0.000968
2 -0.450737  1.729780 -1.630613  0.080094

In [309]:
df5.loc[2]['c'] = np.nan

In [311]:
df5.loc[0]['c'] = -1.398453

In [312]:
df5

          a         b         c         d
0  0.515993       NaN -1.398453  1.023572
1  0.107543 -0.833964 -0.816209  0.000968
2 -0.450737  1.729780       NaN  0.080094

In [313]:
df5.count() # columns

a    3
b    2
c    2
d    3
dtype: int64

In [314]:
df5.count(axis = 1) # by row

0    3
1    4
2    3
dtype: int64

In [315]:
df5.sum() # by columns

a    0.172799
b    0.895817
c   -2.214662
d    1.104633
dtype: float64

In [316]:
df5.sum(axis = 1 ) # by row

0    0.141112
1   -1.541662
2    1.359137
dtype: float64

In [317]:
df5.sum(skipna = False) # by columns

a    0.172799
b         NaN
c         NaN
d    1.104633
dtype: float64

In [318]:
df5.sum(axis=1, skipna= True)

0    0.141112
1   -1.541662
2    1.359137
dtype: float64

In [319]:
df5.describe()

              a         b         c         d
count  3.000000  2.000000  2.000000  3.000000
mean   0.057600  0.447908 -1.107331  0.368211
std    0.485297  1.812841  0.411708  0.568936
min   -0.450737 -0.833964 -1.398453  0.000968
25%   -0.171597 -0.193028 -1.252892  0.040531
50%    0.107543  0.447908 -1.107331  0.080094
75%    0.311768  1.088844 -0.961770  0.551833
max    0.515993  1.729780 -0.816209  1.023572

In [320]:
df5

          a         b         c         d
0  0.515993       NaN -1.398453  1.023572
1  0.107543 -0.833964 -0.816209  0.000968
2 -0.450737  1.729780       NaN  0.080094

In [322]:
s5 = pd.Series(['a','a','b','c', 'c','c'])

In [323]:
print(s5)

0    a
1    a
2    b
3    c
4    c
5    c
dtype: object

In [324]:
s5.describe()

count     6
unique    3
top       c
freq      3
dtype: object

In [325]:
s6 = pd.Series([2,3,5,7,11,13])

In [326]:
print(s6)

0     2
1     3
2     5
3     7
4    11
5    13
dtype: int64

In [327]:
s6.describe()

count     6.000000
mean      6.833333
std       4.400758
min       2.000000
25%       3.500000
50%       6.000000
75%      10.000000
max      13.000000
dtype: float64

In [328]:
df5

          a         b         c         d
0  0.515993       NaN -1.398453  1.023572
1  0.107543 -0.833964 -0.816209  0.000968
2 -0.450737  1.729780       NaN  0.080094

In [329]:
df5.max()

a    0.515993
b    1.729780
c   -0.816209
d    1.023572
dtype: float64

In [330]:
abs(df5).max()

a    0.515993
b    1.729780
c    1.398453
d    1.023572
dtype: float64

In [331]:
df5.mean()

a    0.057600
b    0.447908
c   -1.107331
d    0.368211
dtype: float64

In [332]:
df5.describe()

              a         b         c         d
count  3.000000  2.000000  2.000000  3.000000
mean   0.057600  0.447908 -1.107331  0.368211
std    0.485297  1.812841  0.411708  0.568936
min   -0.450737 -0.833964 -1.398453  0.000968
25%   -0.171597 -0.193028 -1.252892  0.040531
50%    0.107543  0.447908 -1.107331  0.080094
75%    0.311768  1.088844 -0.961770  0.551833
max    0.515993  1.729780 -0.816209  1.023572

In [333]:
df5.idxmin() # -> 곧바로 집어넣어서 기록된 값을 출력해주는 건 어떻게 할까?

a    2
b    1
c    0
d    1
dtype: int64

In [334]:
df5.idxmax()

a    0
b    2
c    1
d    0
dtype: int64

In [336]:
df5.var() # variance 각 column의

a    0.235513
b    3.286392
c    0.169504
d    0.323688
dtype: float64

In [337]:
df5.std() # standard variance sqrt(sigma(avg - variable_i)^2 )

a    0.485297
b    1.812841
c    0.411708
d    0.568936
dtype: float64

In [338]:
df5.cumsum() # accumulated sum

          a         b         c         d
0  0.515993       NaN -1.398453  1.023572
1  0.623537 -0.833964 -2.214662  1.024539
2  0.172799  0.895817       NaN  1.104633

In [339]:
df5

          a         b         c         d
0  0.515993       NaN -1.398453  1.023572
1  0.107543 -0.833964 -0.816209  0.000968
2 -0.450737  1.729780       NaN  0.080094